/**
 * 一些配置
 */

export const VERSION = {
  V1: 'Vocaloid Motion Data file',
  V2: 'Vocaloid Motion Data 0002'
}

export const VERSION_BUFFER_LENGTH = 30

export const MODEL_NAME_LENGTH = {
  [VERSION.V1]: 10,
  [VERSION.V2]: 20
}

export const TYPE = {
  int8_t: Int8Array,
  uint8_t: Uint8Array,
  int16_t: Int16Array,
  uint16_t: Uint16Array,
  int32_t: Int32Array,
  uint32_t: Uint32Array,
  float: Float32Array,
  double: Float64Array
}

/**
 * 骨骼名称
 */
export const BONE_NAME = ['センター', '上半身', '首', '頭', '左目', '右目', 'ﾈｸﾀｲ１', 'ﾈｸﾀｲ２', 'ﾈｸﾀｲ３', '下半身', '腰飾り', '左髪１', '左髪２', '左髪３', '左髪４', '左髪５', '左髪６', '左肩', '左腕', '左腕捩', '左ひじ', '左手捩', '左手首', '左袖', '左親指１', '左親指２', '左人指１', '左人指２', '左人指３', '左中指１', '左中指２', '左中指３', '左薬指１', '左薬指２', '左薬指３', '左小指１', '左小指２', '左小指３', '左ｽｶｰﾄ前', '左ｽｶｰﾄ後', '左足', '左ひざ', '左足首', '右髪１', '右髪２', '右髪３', '右髪４', '右髪５', '右髪６', '右肩', '右腕', '右腕捩', '右ひじ', '右手捩', '右手首', '右袖', '右親指１', '右親指２', '右人指１', '右人指２', '右人指３', '右中指１', '右中指２', '右中指３', '右薬指１', '右薬指２', '右薬指３', '右小指１', '右小指２', '右小指３', '右ｽｶｰﾄ前', '右ｽｶｰﾄ後', '右足', '右ひざ', '右足首', '両目', '前髪１', '前髪２', '前髪３', '左目光', '右目光', 'ﾈｸﾀｲ４', '左髪７', '右髪７', '左つま先', '右つま先', 'ﾈｸﾀｲＩＫ', '左髪ＩＫ', '右髪ＩＫ', '左足ＩＫ', '右足ＩＫ', '左つま先ＩＫ', '右つま先ＩＫ', '下半身先', '頭先', '左目先', '右目先', '腰飾り先', '左袖先', '左手先', '左親指先', '左人差指先', '左中指先', '左薬指先', '左小指先', '左スカート前先', '左スカート後先', '右袖先', '右手先', '右親指先', '右人差指先', '右中指先', '右薬指先', '右小指先', '右スカート前先', '右スカート後先', 'センター先', '両目先', 'ﾈｸﾀｲＩＫ先', '左髪ＩＫ先', '右髪ＩＫ先', '左足ＩＫ先', '右足ＩＫ先', '左つま先ＩＫ先', '右つま先ＩＫ先', '前髪１先', '前髪２先', '前髪３先', '左目光先', '右目光先', '左腕捩先', '左手捩先', '右腕捩先', '右手捩先', '左腕捩1', '左腕捩2', '左腕捩3', '右腕捩1', '右腕捩2', '右腕捩3']
